NOTE_COLOR_SKILL = {
    "R":  {"name": "Красный (Red)",               "rgb": (255, 0, 0)},
    "F#": {"name": "Оранжевый (Orange)",          "rgb": (255, 140, 0)},
    "G":  {"name": "Желтый (Yellow)",             "rgb": (255, 255, 0)},
    "G#": {"name": "Шартрёз (Chartreuse)",        "rgb": (127, 255, 0)},
    "A":  {"name": "Зеленый (Green)",             "rgb": (0, 128, 0)},
    "A#": {"name": "Весенний (Spring Green)",     "rgb": (0, 255, 127)},
    "B":  {"name": "Циан (Cyan)",                 "rgb": (0, 255, 255)},
    "C":  {"name": "Лазурный (Azure)",            "rgb": (0, 127, 255)},
    "C#": {"name": "Синий (Blue)",                "rgb": (0, 0, 255)},
    "D":  {"name": "Фиолетовый (Violet)",         "rgb": (148, 0, 211)},
    "D#": {"name": "Маджента (Magenta)",          "rgb": (255, 0, 255)},
    "E":  {"name": "Розовый (Rose)",              "rgb": (243, 58, 106)}
}